{
  "id": "398",
  "lang": "fa",
  "content": [
    { "topTitle": "مطالعه موردی جهانی" },
    {
      "mainTitle": "هزینه‌ هر میلی‌ثانیه: آنچه آمازون درباره‌ بهینه‌سازی عملکرد آموخت"
    },
    {
      "subTitle": "در سال ۲۰۰۶، یک تست A/B در آمازون نشان داد که تنها ۱۰۰ میلی‌ثانیه افزایش در زمان بارگذاری صفحه، به طور متوسط حدود ۱٪ از درآمد را کاهش می‌دهد. این معادله‌ی ساده باعث شد که عملکرد فنی به یک اولویت در سطح هیئت‌مدیره تبدیل شود و آغازگر یک بازنگری چندساله در معماری، فرهنگ سازمانی و ابزارهای فنی باشد — مسیری که میلیاردها دلار ارزش جدید خلق کرد."
    },
    {
      "infoBox": [
        { "title": "منتشر شده در", "subTitle": " مارس ۲۰۲۰" },
        { "title": "مدت زمان مطالعه", "subTitle": "10 دقیقه" },
        { "title": "دسته‌بندی", "subTitle": "توسعه اپلیکیشن" }
      ]
    },
    { "image": "/amazon-banner.svg" },
    {
      "title": "آغاز چالش: وقتی معماری قدیمی سرعت را محدود کرد"
    },
    {
      "p": "اوایل سال ۲۰۰۶، یکی از مهندسان نرم‌افزار آمازون، گرگ لیندن، به صورت آزمایشی تاخیر مصنوعی به فرایند خرید اضافه کرد (به صورت افزایشی و در بازه‌های ۱۰۰ میلی‌ثانیه‌ای)، و تاثیر آن را با تست A/B روی کاربران واقعی سنجید. نتایج، مدیریت را شگفت‌زده کرد: به ازای هر ۱۰۰ میلی‌ثانیه تاخیر، تقریبا ۱٪ از فروش ناخالص کاهش پیدا می‌کرد — که در مقیاس روزهای پیک فروش مثل تعطیلات، به معنای میلیون‌ها دلار کاهش درآمد روزانه بود. لیندن این یافته را در یک اسلاید با عنوان معروف «سرعت مهم است» خلاصه کرد؛ این اسلاید بعدها در دوره‌ی CS345 دانشگاه استنفورد هم تدریس شد و تبدیل به یک منبع مرجع برای مدیران فنی جدید آمازون شد. جف بزوس شخصا این نمودار را برای اعضای تیم ارشد ارسال کرد و دستور واضحی داد: «هفته‌ی آینده سریع‌ترین و کندترین صفحات‌تان را بیاورید». از آن لحظه به بعد، زمان پاسخ‌دهی هم در کنار قیمت، تنوع محصول و راحتی تجربه به یکی از شاخص‌های کلیدی در بهبود تجربه‌ی مشتری در آمازون تبدیل شد."
    },
    {
      "title": "آزمایشی که همه‌چیز را تغییر داد - بهای ۱۰۰ میلی‌ثانیه تاخیر"
    },
    {
      "p": "تا اواخر دهه ۱۹۹۰، سایت خرده‌فروشی آمازون روی یک سیستم دومرحله‌ای با معماری Perl/C به نام Obidos اجرا می‌شد؛ پشت این سیستم، تنها یک کلاستر مشترک از دیتابیس Oracle قرار داشت.\n یک یادداشت داخلی در سال ۱۹۹۸ تحت عنوان «بیانیه‌ی معماری توزیع‌شده» هشدار داده بود که با رشد ترافیک جهانی، این جداول مشترک به «گلوگاه نوآوری» تبدیل شده‌اند. هم‌ زمانِ بارگذاری صفحات را افزایش می‌دهند و هم سرعت توسعه را کند می‌کنند.\nزمان متوسط بارگذاری صفحات برای کاربران آمریکایی به بیش از ۲ ثانیه رسیده بود؛ کاربران در کشورهای دورتر مانند استرالیا یا برزیل، که باید از مسیرهای شبکه‌ای چندمرحله‌ای به سرورهای آمریکا متصل می‌شدند، گاهی باید ۴ تا ۵ ثانیه منتظر می‌ماندند.\nیکی از مهندسان با تجربه‌ی مقیاس‌پذیری، لی اچیسون، بعدها به یاد می‌آورد که یک جستجوی ساده در کاتالوگ محصول، بیش از ۱۰۰ کوئری join به دیتابیس نیاز داشت. اضافه کردن یک join دیگر برای یک قابلیت جدید در ظاهر تغییر کوچکی بود — اما وقتی صدها «تغییر کوچک» به تدریج در سیستم انباشته شدند، در محیط عملیات (production)، به بحران عملکرد تبدیل شدند.\nاما چون تا آن زمان هزینه‌ی دلاریِ این کندی به طور مستقیم ثابت نشده بود، بهبود عملکرد معمولا در رقابت با افزودن قابلیت‌های جدید، در اولویت پایین‌تری قرار می‌گرفت."
    },
    {
      "title": "آزمایشی که هزینه تاخیر را تعیین کرد. محاسبه کاهش درآمد به ازای هر ۱۰۰ میلی‌ثانیه"
    },
    {
      "p": "تا اواخر دهه ۱۹۹۰، سایت خرده‌فروشی آمازون روی یک سیستم دومرحله‌ای با معماری Perl/C به نام Obidos اجرا می‌شد؛ پشت این سیستم، تنها یک کلاستر مشترک از دیتابیس Oracle قرار داشت.\n یک یادداشت داخلی در سال ۱۹۹۸ تحت عنوان «بیانیه‌ی معماری توزیع‌شده» هشدار داده بود که با رشد ترافیک جهانی، این جداول مشترک به «گلوگاه نوآوری» تبدیل شده‌اند. هم‌ زمانِ بارگذاری صفحات را افزایش می‌دهند و هم سرعت توسعه را کند می‌کنند."
    },
    {
      "p": "زمان متوسط بارگذاری صفحات برای کاربران آمریکایی به بیش از ۲ ثانیه رسیده بود؛ کاربران در کشورهای دورتر مانند استرالیا یا برزیل، که باید از مسیرهای شبکه‌ای چندمرحله‌ای به سرورهای آمریکا متصل می‌شدند، گاهی باید ۴ تا ۵ ثانیه منتظر می‌ماندند."
    },
    {
      "p": "یکی از مهندسان با تجربه‌ی مقیاس‌پذیری، لی اچیسون، بعدها به یاد می‌آورد که یک جستجوی ساده در کاتالوگ محصول، بیش از ۱۰۰ کوئری join به دیتابیس نیاز داشت. اضافه کردن یک join دیگر برای یک قابلیت جدید در ظاهر تغییر کوچکی بود — اما وقتی صدها «تغییر کوچک» به تدریج در سیستم انباشته شدند، در محیط عملیات (production)، به بحران عملکرد تبدیل شدند. اما چون تا آن زمان هزینه‌ی دلاریِ این کندی به طور مستقیم ثابت نشده بود، بهبود عملکرد معمولا در رقابت با افزودن قابلیت‌های جدید، در اولویت پایین‌تری قرار می‌گرفت."
    },
    {
      "title": "آزمایشی که هزینه تاخیر را تعیین کرد. محاسبه کاهش درآمد به ازای هر ۱۰۰ میلی‌ثانیه"
    },
    {
      "p": "تست لیندن بالاخره شکاف بین معیارهای فنی و سود و زیان شرکت را پُر کرد. تیم مهندسی با افزودن توقف‌های زمانی (sleep) در سمت سرور، تأثیر نوسانات شبکه را حذف کرد و توانست تأثیر دقیق تاخیر بر رفتار خرید کاربران را بررسی کند.\nنتایج تقریبا خطی بودند: به‌طور میانگین، هر ۱۰۰ میلی‌ثانیه تاخیر باعث افت حدود ۱٪ در درآمد می‌شد.\nنکته نگران‌کننده‌تر این بود که خریداران موبایلی—که در آن زمان هنوز بخش کوچکی ولی با رشد سریع بودند—تقریبا دو برابر حساس‌تر به تاخیر بودند.\nآزمایش مشابهی هم روی صفحات محصول انجام شد و همان روند را تأیید کرد، اما خیلی زود متوقف شد، چون «زیان مالی آن‌قدر بالا بود که ادامه آزمایش به‌صرفه نبود.»\nاین آزمایش، افسانه‌ی رایجی را از بین برد که می‌گفت کاربران برای قابلیت‌های جدید، صفحات کندتر را تحمل می‌کنند. برعکس، مشخص شد که خودِ سرعت یک قابلیت مهم است—قابلیتی که کاربران حاضر بودند با خرید بیشتر، بابتش هزینه بپردازند.\nجف بزوس این یافته را این‌طور توصیف کرد: «واضح‌ترین رابطه‌ای که تا به حال بین مهندسی و پول دیده‌ایم»—برگرفته از گزارش عملیاتی داخلی در سال ۲۰۰۷، که لیندن در وبلاگش به آن اشاره کرده است."
    },
    {
      "title": "تبدیل سرعت به یک الزام سراسری – بودجه‌ تاخیر، شروط انتشار و پاسخ‌گویی مدیریتی"
    },
    {
      "p": "فقط چند ماه بعد از آزمایش لیندن، هر سند نیازمندی محصول (PRD) در آمازون شامل یک جدول «بودجه تاخیر» شد—با اهداف زمانی مشخص برای پاسخ‌دهی در صدک‌های ۵۰، ۹۰ و ۹۹ کل فرآیند درخواست. اگر محصولی این بودجه را رعایت نمی‌کرد، درست مثل نقض آسیب‌پذیری امنیتی، اجازه انتشار پیدا نمی‌کرد.\nتست‌های عملکرد به بخشی از فرآیند ادغام مداوم (CI) تبدیل شدند. تیم‌ها ابزارهایی برای شبیه‌سازی بار و بررسی عملکرد مسیرهای کلیدی اضافه کردند که در صورت عبور زمان پاسخ از حد مجاز، باعث توقف خودکار بیلد می‌شدند.\nاندی جسی، مدیرعامل وقت آمازون، در نشست Harvard Business Review گفت: «سرعت، یک تصمیم مدیریتی است»، و تأکید کرد که رهبران باید «ساختارهای مانع را شناسایی و حذف کنند» تا تیم‌ها بتوانند سریع باقی بمانند.\nدر جلسات ماهانه عملیاتی، گزارشی از وضعیت سرعت بارگذاری صفحات درست زیر گزارش‌های درآمد و سود شرکت قرار می‌گرفت و با رنگ‌های سبز، زرد و قرمز، وضعیت بخش‌های مختلف را نشان می‌داد. هر تیمی که قصد داشت درخواست جدیدی به یک سرویس دیگر اضافه کند، باید راه‌حلی ارائه می‌داد تا تاخیر اضافه‌شده جبران شود. مثلا با کش کردن پاسخ، انجام آن درخواست در زمان یا مسیر غیربحرانی، یا حذف عملیات دیگری که زمان‌بر بود."
    },
    {
      "title": "وقتی سرعت ارزش می‌شود: فرهنگ‌سازی، نظارت و مشوق‌های داخلی"
    },
    {
      "p": "آمازون نگاه به سرعت را در فرهنگ سازمانی خود نهادینه کرد و آن را وارد اصول رهبری شرکت کرد—از جمله اصل «تمایل به اقدام» که توضیح می‌دهد: «سرعت در کسب‌وکار اهمیت دارد.»\nمدیران فنی، نقش‌هایی به نام «نگهبان سرعت» (speed bar-raiser) تعیین کردند. مهندس‌هایی که اختیار داشتند اگر طراحی یک سیستم باعث کندی می‌شد، جلوی آن را بگیرند، حتی اگر تیم توسعه با آن موافق بود.\nسیاستی به نام «مالیات عملکرد» وضع شد: اگر تیمی باعث کندتر شدن سیستم می‌شد، موظف بود در ابتدای اسپرینت بعدی، اولین کاری که انجام می‌دهد، رفع آن مشکل باشد. از طرف دیگر، اگر تیمی موفق می‌شد حتی ۲۵ میلی‌ثانیه از زمان پاسخ یک مسیر پرترافیک را کم کند، در داخل شرکت به‌صورت عمومی تحسین می‌شد و گاهی هم پاداش نقدی می‌گرفت.\nداشبوردهای داخلی آمازون، سازمان‌های مختلف را بر اساس مجموع میلی‌ثانیه‌هایی که در هر فصل کاهش داده بودند رتبه‌بندی می‌کرد که باعث رقابت مثبت بین تیم‌ها می‌شد.\nایمیل اندی جسی در سال ۲۰۲۴ درباره فرهنگ سازمانی این نکته را برجسته می‌کرد: «سرعت تصمیم‌گیری، با وفاداری مشتری ارتباط مستقیم دارد. صفحات کند، باعث ریزش خاموش مشتریان می‌شوند»."    },
    {
      "title": "اثر اقتصادی سرعت: از بهبود خرید موبایلی تا صرفه‌جویی‌های چند میلیون دلاری"
    },
    {
      "p": "سخت‌گیری‌های جدید خیلی زود نتیجه داد. در سال ۲۰۱۲، تیم پرداخت آمازون یکی از فراخوان‌های تکراری بررسی تقلب را حذف کرد. این تغییر باعث کاهش ۳۰۰ میلی‌ثانیه‌ای در زمان پرداخت موبایلی شد و نرخ موفقیت خرید را حدود ۶٪ بالا برد—تحلیلی که ارزش این بهبود را سالانه ۴۰۰ میلیون دلار تخمین زد.\nهمچنین استفاده از شبکه تحویل محتوا (CloudFront) که در سال ۲۰۰۸ با ۱۴ نقطه دسترسی راه‌اندازی شد، زمان بارگذاری تصاویر برای کاربران سیدنی را از ۳.۲ ثانیه به ۹۰۰ میلی‌ثانیه رساند. این کاهش زمان، نرخ اضافه کردن کالا به سبد خرید را در استرالیا ۱۲٪ افزایش داد.\nپانزده سال بعد، CloudFront با بیش از ۶۰۰ نقطه دسترسی، حتی رویدادهایی مثل جام جهانی فوتبال و NFL را با تاخیر کمتر از یک ثانیه به بینندگان منتقل می‌کند.\nیادداشت‌های مالی که در وبلاگ AllThingsDistributed به آن‌ها اشاره شده، پروژه‌های کاهش تاخیر را عامل صرفه‌جویی ۶۶ میلیون دلاری در هزینه‌های عملیاتی زیرساخت آمازون در سال ۲۰۱۴ می‌دانند. صرفه‌جویی‌ای که به لطف کاهش نیاز به تکرار انتقال داده و بهره‌برداری مؤثرتر از سرورهای EC2 حاصل شده بود.\nحتی در تصمیم‌هایی که اولویت با کاهش هزینه بود، مثل تصمیم Prime Video در سال ۲۰۲۳ برای ادغام چند سرویس جداگانه در یک فرآیند واحد، باز هم هدف اصلی کاهش تاخیر بود: این تجمیع باعث شد مصرف منابع ۹۰٪ کمتر شود و ۳۵ میلی‌ثانیه از زمان پاسخ در نقاط انتهایی کاسته شود.\nدر تجربه آمازون، صفحات سریع‌تر فقط باعث حفظ مشتری نمی‌شوند؛ بلکه بودجه لازم برای توسعه فنی آینده را هم تأمین می‌کنند و این یعنی چرخ شرکت همیشه در حال چرخیدن می‌ماند."
    },
    { "title": "نتیجه‌گیری" },
    {
      "p": "کشف تأثیر ۱۰۰ میلی‌ثانیه‌ای آمازون نشان داد که میلی‌ثانیه‌ها می‌توانند به میلیون‌ها دلار تبدیل شوند. این شرکت با تبدیل عملکرد به یک دغدغه دائمی—هم از نظر فنی (مثل معماری مبتنی بر مایکروسرویس، CloudFront و بودجه‌های تاخیر) و هم از نظر فرهنگی (مثل الزامات مدیریتی و سیستم‌های تشویقی)—یک چرخه‌ی خودتقویت‌شونده ساخت که در آن سرعت، هم درآمد را افزایش می‌دهد و هم نوآوری را جلو می‌برد.\nتیم‌هایی که برنامه‌های بهینه‌سازی عملکرد را بر اساس داده‌های واقعی طراحی و اجرا می‌کنند، می‌توانند انتظار داشته باشند که علاوه‌بر رضایت بیشتر کاربران، تأثیر محسوسی هم در رشد کسب‌وکار خود ببینند."
    }
  ]
}
